{
  "version": "https://jsonfeed.org/version/1",
  "title": "Solid Quant",
  "home_page_url": "https://solidquant.github.io",
  "feed_url": "https://example.com/feed/feed.json",
  "description": "A quant hobbyist&#39;s soul search",
  "author": {
    "name": "Solid Quant",
    "url": "https://solidquant.github.io"
  },
  "items": [{
      "id": "https://solidquant.github.io/blog/post/i-decided-to-build-my-own-mev-bot.-here&amp;#39;s-how-i&amp;#39;m-going-to-do-it./",
      "url": "https://solidquant.github.io/blog/post/i-decided-to-build-my-own-mev-bot.-here&amp;#39;s-how-i&amp;#39;m-going-to-do-it./",
      "title": "I decided to build my own MEV bot. Here&#39;s how I&#39;m going to do it.",
      "content_html": "<p> </p>\n<h4 id=\"starting-point\" tabindex=\"-1\">Starting point</h4>\n<p><img src=\"https://miro.medium.com/v2/resize:fit:1400/format:webp/1*RaERN75kQoEANhdXTWEyMg.png\" alt=\"Flashbots\"></p>\n<p> </p>\n<p>I only recently found out about the realm of MEVs despite having traded in the crypto space for some time already. My work mainly revolved around trading in spots and futures markets in CeFi, so I never really bothered to look into DeFi that much.</p>\n<p>But one of my clients wanted to build an automated trading bot using Uniswap V3. And I thought: <em>‘Oh, what the heck. How hard can it be?’</em>, and just took on the project.</p>\n<p>Oh boy, was I in for a bumpy ride 🧗🏼.</p>\n<p>Though I briefly knew what an AMM was, I never really grasped the math behind it. So I scanned through documentations and public resources I could find on Google. It took me like a week to really get a picture of what DEXs were trying to do. And it took another couple of days to build a JS bot that monitored Uniswap V3 pool prices and sent swapping transactions upon predefined events.</p>\n<p>After the project was over, I was intrigued by DeFi and wanted to further pursue this path, but then was met with this giant called <strong>MEV</strong>.</p>\n<p>Instead of just giving up, I decided to tackle the problem head on and face the giant. I would learn everything about MEV bots and just create one for myself. Then I’ll be able to overcome the fear, and maybe even successfully find my own alpha.</p>\n<p>But the most important reason for this venture is to understand the cutting edge technologies behind blockchain ecosystems. I hated how I feared leaving my safety zone and considering blockchains and DeFi’s as black boxes. I knew if I put the time in, I would be able to understand the concepts with confidence.</p>\n<p><strong>So I am documenting the whole process here to give other starting fellows an idea of how much input you are going to need to put into building MEV bots.</strong></p>\n<p>Below, I am sharing the complete road map to learning MEV bot building. Since I am just a beginner in this space, I decided to build a bot from the ground up and gauge the time it would take someone to build such a program with no prior knowledge of this domain whatsoever. But I wanted to do it the right and the robust way.</p>\n<p><em><strong>A little background sharing of myself:</strong> I used to build high frequency trading strategies in CeFi for the past 2 years, and I used to be an AI engineer before that for another couple of years. So I’m not entirely new to programming per se. I used Python, Javascript, and C# extensively in multiple projects, but always had the temptation to adopt Rust within my newer ones. So I’ve decided to study Rust this time.</em></p>\n<p> </p>\n<h4 id=\"my-roadmap\" tabindex=\"-1\">My Roadmap</h4>\n<p>I embarked on this journey just 3 days ago (June 7th, 2023). <em>(So yes, my resolution might not stick too long)</em> The first 3 days involved planning ahead by understanding what I am trying to accomplish here.</p>\n<p>The MEV space was quite secretive so I couldn’t find a good reference for a starting point. But digging around kind of paid off and I noticed that there were pretty huge communities either trying to fix the MEV issue, or profit from it. They were both extremely helpful to begin the journey.</p>\n<p>A couple of reference points:</p>\n<ul>\n<li><a href=\"https://www.flashbots.net/\">Flashbots</a></li>\n<li><a href=\"https://calblockchain.mirror.xyz/c56CHOu-Wow_50qPp2Wlg0rhUvdz1HLbGSUWlB_KX9o\">The 0 to 1 Guide for MEV</a></li>\n</ul>\n<p>I also noticed that there were many scams out there related to MEVs. So I had to filter out my sources with extra care.</p>\n<hr>\n<p> </p>\n<p>I intend to study all of the following:</p>\n<p><strong>1. Rust</strong><br>\n<strong>2. Solidity/Yul</strong><br>\n<strong>3. Uniswap</strong><br>\n<strong>4. Flashloans</strong><br>\n<strong>5. Gas optimization</strong><br>\n<strong>6. Flashbots</strong></p>\n<p>I’ve also seen on Twitter that studying Geth is probably the best way to get started with MEV. Though for me, that’s a pretty big hurdle. So I’ll see what I can achieve with the minimum amount of knowledge necessary and build up from there if I feel like more is needed.</p>\n<p><a href=\"https://twitter.com/0xEzon/status/1667212919132790784?ref_src=twsrc%5Etfw\">Go read Twitter thread by 0xEzon 👉</a></p>\n<p>With this knowledge, I plan on building the 3 types of MEV bots that people are most familiar with:</p>\n<p><strong>1. Bot #1: Frontrunning bot</strong><br>\n<strong>2. Bot #2: Sandwiching bot</strong><br>\n<strong>3. Bot #3: Uniswap JIT provisioning bot</strong></p>\n<p>and share the results to this community.</p>\n<p>I’ll try and see how difficult the task is for a layman to get started with, also documenting the sources that I’ve referred to as I move on forward. And by doing this, I feel like I can make my resolution stick this time, and help others trying to get involved with MEVs by giving them an idea of how difficult the task is, and how long it will take for them to get started.</p>\n<p>Anyone else with me on this journey? Good luck everyone!</p>\n",
      "date_published": "2023-06-10T00:00:00Z"
    },{
      "id": "https://solidquant.github.io/blog/post/why-i&amp;#39;m-starting-this-blog/",
      "url": "https://solidquant.github.io/blog/post/why-i&amp;#39;m-starting-this-blog/",
      "title": "Why I&#39;m starting this blog",
      "content_html": "<p> </p>\n<h4 id=\"hello-there\" tabindex=\"-1\">Hello there</h4>\n<p>Hello, everyone! This is my very first blog post, and I’m actually pretty excited. I’ve been willing to start a blog for quite some time now but failed to do so for various reasons - the biggest reason being busy work.</p>\n<p>I have worked on numerous projects in the past couple of years, ranging from AI services to building algo trading systems and even selling spicy torched chicken with mozzarella cheese on top 🍗, which tasted amazing, by the way. There were people waiting in line to get a taste of that chicken. Yum!</p>\n<p>I majored in liberal arts when I was in college, so I never really had the chance to receive proper technical training, and I always had some regrets. The last venture I jumped into did fairly well, but the same logic applied here. If you were going to start a tech company, you had to know your tech inside out. However, as an amateur, I spent the nights studying and building at the same time, which lasted for over 2 years.</p>\n<p>This experience helped me reach new heights, but I fell into a slump after those tolling days. I wasn’t sure of what I was doing. So, after I talked to my team members, I left the company and decided to take a break from everything for a while. I really needed to do some soul-searching before I could figure out what I really wanted to do.</p>\n<p>And this blog is an attempt to document the things that I am interested in and the new projects I would like to delve into. I named it Solid Quant because I knew I would want to do quant-related projects somehow. It has been my passion for a very long time, and the emerging Web3 industry really excites me.</p>\n<p>I hope to meet new people here and find our passions together. As a non-native English speaker, I found it difficult to meet new people with the same interests from my country.</p>\n<p>Thank you for reading my blog. I’ll see you all in the next post! 😀</p>\n<p> </p>\n<h4 id=\"do-we-really-need-another-quant-blog%3F\" tabindex=\"-1\">Do we really need another quant blog?</h4>\n<p><em>Answer:</em></p>\n<p>Of course, we do. All quants pursue different strategies and each and every one of them differ in ways that can help others.</p>\n<p>I am planning to build algo trading systems from the ground up, and at the same time dig into Web3 projects to extend my systems to work on the blockchain as well. Though I’m by no means an expert in this field yet, I aspire to become one in the future.</p>\n<p>Moreover, I believe that sharing my knowledge and code with others is an effective way to identify any blind spots I may have. I am eager to engage in meaningful discussions and learn how to address any gaps in my understanding.</p>\n<p>So, anyone interested in learning, or people looking to get ideas can browse through and stick around if they feel like it.</p>\n<p>It should be amazing!</p>\n",
      "date_published": "2023-06-10T00:00:00Z"
    }
  ]
}